{"version":"1","records":[{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows"},"type":"lvl1","url":"/blog-post","position":0},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows"},"content":"Recent generations of Americans are on track to have fewer children than previous generations. Based on projections from a Bayesian model, cohorts born in the 2000s could end up with fewer than 1 child per woman on average—a level of fertility comparable to present-day South Korea.\n\nThe following figure shows the results from the model for US women born from 1920 to 2009, along with observed cohort fertility rates (CFR) from Census data.\n\nFertility peaked with the cohort born in 1934, who had 3.1 children per woman.\n\nThe cohort born in 1980 have 1.9 children on average, having reached the end of their childbearing years.\n\nWomen born in 1990 might have 1.4 children on average, based on data up to age 34 and the model’s projections.\n\nWomen born in 2000 might have only 0.9 children on average, based on data up to age 24 and projections.\n\nThe shaded area is a credible interval for the projections, showing increasing uncertainty for the youngest cohorts.\n\nFor cohorts who have completed their childbearing, we can compare the model’s retrodictions to data from the CPS Fertility Supplement. The agreement is very good.\n\nNote that this figure shows completed cohort fertility rates (CFR), not total fertility rates (TFR). \n\nThis article explains the difference.","type":"content","url":"/blog-post","position":1},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"How the Model Works"},"type":"lvl2","url":"/blog-post#how-the-model-works","position":2},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"How the Model Works"},"content":"These projections are based on a Bayesian hierarchical model that uses data from the \n\nCPS Fertility Supplement, which includes 1.17 million women observed during 1976-2024 at ages 15-54. The model estimates two sets of parameters:\n\nCohort effects (α): For each 3-year cohort group, this parameter quantifies overall fertility level.\n\nAge effects (β): For each 3-year age group, this parameter quantifies age-specific fertility.\n\nThe model uses a log-linear structure:\\log(\\lambda_{ij}) = \\alpha_i + \\beta_j\n\nwhere \\lambda_{ij} is the expected birth rate for cohort i at age j (Poisson intensity, births per woman-year). The parameters are on a log scale, so they’re not easy to interpret in absolute terms. But we can understand them as differences in fertility between groups.","type":"content","url":"/blog-post#how-the-model-works","position":3},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Cohort and age effects"},"type":"lvl2","url":"/blog-post#cohort-and-age-effects","position":4},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Cohort and age effects"},"content":"The next figure shows the cohort effects—that is, a fertility level for each generation.\n\nThe cohort effects capture the overall fertility level for each generation.\n\nFertility was highest among the cohorts born between 1925 and 1940, who were the parents of the Baby Boomers.\n\nFertility was lower but mostly unchanged among cohorts born between 1950 and 1985.\n\nEstimated fertility declines substantially among cohorts born after 1985.\n\nBut for the youngest cohorts we have limited data.\nFor example, the cohort born in 2000 has been observed at ages 15-24, covering just one-third of their reproductive span.\nThe last cohort, born in 2009, has been observed only at age 15, which provides minimal information about their future fertility.\n\nProjections for these cohorts rely on the model’s assumptions, not just on observed data. For cohort effects, the model uses a Gaussian random walk, which assumes each cohort will be similar to the previous one unless there is evidence of a change.\n\nFor generations where we have complete data, we can estimate these changes precisely. Where we have less data, the random walk levels out -- so it doesn’t extrapolate the trend or assume it will reverse -- and becomes more uncertain.\n\nThe next figure shows the age effects—the typical age pattern of childbearing.\n\nThe age effects show that fertility peaks in the mid-20s and declines thereafter.\nThe age effects are also based on a random walk, so where we have limited data, the estimates level off and become more uncertain.\n\nBy combining cohort and age effects, we can project lifetime fertility for cohorts still in their reproductive years.","type":"content","url":"/blog-post#cohort-and-age-effects","position":5},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Model Extensions"},"type":"lvl2","url":"/blog-post#model-extensions","position":6},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Model Extensions"},"content":"The previous version of the model (v3) does not take into account timing effects -- that is, whether a given cohort has children earlier or later than the typical age pattern.\n\nI also tested an extended version (v4) that adds a timing parameter (γ):\\log(\\lambda_{ij}) = \\alpha_i + \\beta_j + \\gamma_i \\times \\text{age}_j\n\nwhere \\gamma_i is a cohort-specific parameter that tilts the age-fertility curve. Positive values of \\gamma mean delayed childbearing (fertility shifts to older ages), while negative values mean earlier childbearing (fertility shifts to younger ages).\n\nThe extended model fits the data better, but the projections it produces are not substantially different. The following figure shows the differences.\n\nDetails of the extended model are in the \n\nTechnical Report.","type":"content","url":"/blog-post#model-extensions","position":7},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Summary"},"type":"lvl2","url":"/blog-post#summary","position":8},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Summary"},"content":"Using a Bayesian model and nearly 50 years of fertility data, we can project cohort fertility rates for generations still in their reproductive years. The model predicts imminent declines to unprecedented levels.\n\nThese projections should be interpreted as “what we expect if recent patterns persist.” Of course, decisions about childbearing respond to changing circumstances -- but demographic trends have momentum. They don’t reverse quickly or easily.\nUnless something changes substantially and soon, US fertility is heading for historic lows.","type":"content","url":"/blog-post#summary","position":9},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Possible Objections and Responses"},"type":"lvl2","url":"/blog-post#possible-objections-and-responses","position":10},{"hierarchy":{"lvl1":"US Fertility Is Heading for Historic Lows","lvl2":"Possible Objections and Responses"},"content":"Objection: CPS fertility data undercounts births, especially among disadvantaged groups.\n\nResponse: This analysis uses the CPS variable “children ever born” (FREVER), which records cumulative parity rather than recent birth events. Parity is generally reported accurately at all ages, especially compared to annual birth measures.\n\nObjection: You are assuming recent fertility declines will continue indefinitely.\n\nResponse: The model does not impose a continued decline. Cohort effects are modeled as a Gaussian random walk, which assumes that each cohort is the same as the previous one unless there is evidence of change. Where we have little data, the random walk levels out -- so it doesn’t extrapolate the trend or assume it will reverse.\n\nObjection: Fertility timing has shifted later; these cohorts may still “catch up.”\n\nResponse: The extended model (v4) includes cohort-specific timing shifts. It fits the data better, but produces similar completed fertility projections. Nevertheless, if conditions change in ways that increase fertility, the most recent generations could catch up, at least in part.\n\nObjection: Is age 42 really the end of childbearing years? Fertility at older ages might increase due to improvements in reproductive technology.\n\nResponse: The model estimates age effects up to age 54, but uses age 42 (midpoint of the 40-44 range) as the endpoint for CFR calculations, consistent with common demographic practice. While fertility at older ages has increased, births to women over 42 are a small fraction of total fertility. Even large relative increases in older-age fertility would have a small effect on overall CFR.\n\nObjection: Immigration could raise future fertility.\n\nResponse: The model includes immigrants who were in the US when surveyed—their fertility is part of the cohort CFR for their birth year. Future immigration could raise overall fertility through compositional changes, if immigrants have higher fertility than natives. However, immigrant fertility in the US has declined, and second-generation fertility converges toward native-born levels. So even with increased immigration, if current trends continue, the compositional effect might be limited. Large, sustained changes in immigration patterns and immigrant fertility would be required to materially change the projections.\n\nObjection: Economic or policy changes (childcare, housing, parental leave) could reverse the trend.\n\nResponse: That is possible. The projections should be interpreted as conditional on current conditions persisting. But demographic trends exhibit inertia, and historically, large fertility reversals have been slow and rare even in the presence of policy interventions.\n\nObjection: A log-linear age–cohort model is too simple to capture fertility dynamics.\n\nResponse: The model is validated on cohorts with completed fertility. The extended model improves in-sample fit but does not materially change the projections for completed cohort fertility. But it’s always possible that a more complex model would capture additional effects and produce different projections.\n\nObjection: CFR below 1 is implausibly low.\n\nResponse: CFR measures the average number of children per woman across the entire cohort, including women with no children. CFRs below 1 are already observed in several high-income countries, including South Korea, so they are demographically feasible.\n\nObjection: Survey weighting via resampling is ad hoc.\n\nResponse: Resampling using survey weights is a standard approximation for incorporating complex survey designs in Bayesian models. The approach is documented in the technical report, and validation against external Census data suggests it performs well for this application.\n\nDATA AND METHODS: The analysis uses \n\nCPS Fertility Supplement data from 1976-2024, covering 1.17 million women aged 15-54. The model is a Bayesian hierarchical log-linear model with Gaussian random walk priors, fit using PyMC. The model accounts for survey weights by resampling and was validated against historical cohort fertility tables. All code and notebooks are available at \n\ngithub​.com​/AllenDowney​/BayesFertility. For complete technical details, see the \n\nTechnical Report.\n\nJanuary 2026","type":"content","url":"/blog-post#possible-objections-and-responses","position":11},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections"},"content":"","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"About This Project"},"type":"lvl2","url":"/#about-this-project","position":2},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"About This Project"},"content":"Fertility rates in the United States and other developed countries have been declining for several decades. Understanding these trends and projecting future fertility patterns is crucial for policy planning in areas such as education, healthcare, and social security. This project uses Bayesian statistical methods to model historical fertility patterns and project future cohort fertility rates using data from the US Census Current Population Survey (CPS).","type":"content","url":"/#about-this-project","position":3},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Motivation"},"type":"lvl2","url":"/#motivation","position":4},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Motivation"},"content":"Cohort fertility rates measure the average number of children born to women in a specific birth cohort over their reproductive lifetime. Unlike period fertility rates (which measure births in a given year), cohort fertility rates better capture long-term trends and can reveal generational shifts in reproductive behavior.\n\nRecent trends suggest that cohorts born after 1980 may experience substantially lower lifetime fertility than previous generations. This has important implications for:\n\nDemographic projections: Population growth and aging patterns\n\nEconomic planning: Labor force size and dependency ratios\n\nSocial policy: Healthcare, education, and retirement systems","type":"content","url":"/#motivation","position":5},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Key Questions"},"type":"lvl2","url":"/#key-questions","position":6},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Key Questions"},"content":"This project addresses several key questions:\n\nWhat are the long-term fertility trends for recent birth cohorts?\n\nHow low might fertility rates go for cohorts currently in their reproductive years?\n\nCan we reliably project future fertility using historical patterns?\n\nHow well do model predictions validate against historical Census data?","type":"content","url":"/#key-questions","position":7},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Contents"},"type":"lvl2","url":"/#contents","position":8},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Contents"},"content":"Technical Report - Full analysis: Comprehensive documentation of data sources, methodology, Bayesian model specification, results, validation, and projections.","type":"content","url":"/#contents","position":9},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Methodology Overview"},"type":"lvl2","url":"/#methodology-overview","position":10},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Methodology Overview"},"content":"Our approach uses a Bayesian hierarchical log-linear model to capture age-specific fertility patterns across birth cohorts:\n\nData: US Census Current Population Survey (CPS) data from 1976-2024\n\nModel structure: Log-linear model with cohort and age effects\n\nPriors: Gaussian random walk priors to capture smooth temporal changes\n\nValidation: Backtesting against historical Census data\n\nProjection: Posterior predictive distributions for future cohort fertility\n\nThe model accounts for survey weights through resampling, ensuring that results reflect the actual US population rather than just the survey respondents.","type":"content","url":"/#methodology-overview","position":11},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Key Findings"},"type":"lvl2","url":"/#key-findings","position":12},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Key Findings"},"content":"Preliminary results suggest:\n\nDeclining fertility for cohorts born after 1980\n\nProjected CFR could drop below 1.0 child per woman for cohorts born in the 2000s\n\nModel validation shows good agreement with historical Census data, increasing confidence in projections\n\nUncertainty quantification provides credible intervals for all projections\n\nFor detailed findings, see the \n\nTechnical Report.","type":"content","url":"/#key-findings","position":13},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Data Sources"},"type":"lvl2","url":"/#data-sources","position":14},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"Data Sources"},"content":"IPUMS CPS: Historical CPS data (June 1976 - June 2022)\n\nUS Census Bureau: June 2024 CPS data\n\nCensus Historical Tables: Validation data for model checking","type":"content","url":"/#data-sources","position":15},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"About the Model"},"type":"lvl2","url":"/#about-the-model","position":16},{"hierarchy":{"lvl1":"Bayesian Fertility Rate Projections","lvl2":"About the Model"},"content":"The Bayesian approach provides several advantages:\n\nUncertainty quantification: All estimates include credible intervals\n\nFlexibility: Can incorporate prior knowledge and handle missing data\n\nValidation: Enables rigorous backtesting and out-of-sample prediction\n\nInterpretability: Parameters have clear demographic interpretations\n\nThis project is a work in progress. Results are preliminary and subject to revision.","type":"content","url":"/#about-the-model","position":17},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections"},"type":"lvl1","url":"/tech-report","position":0},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections"},"content":"","type":"content","url":"/tech-report","position":1},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"Summary"},"type":"lvl2","url":"/tech-report#summary","position":2},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"Summary"},"content":"This report presents a Bayesian statistical model for projecting cohort fertility rates using US Census Current Population Survey (CPS) data spanning 1976-2024. The model uses a hierarchical log-linear structure with Gaussian random walk priors to capture smooth temporal changes in age-specific fertility patterns across birth cohorts. The primary model (Version 4) extends the base model to explicitly capture cohort-specific timing shifts in childbearing, separating quantum (how many children) from tempo (when they are born).\n\nKey findings:\n\nCohort Completed Fertility Rates (CFR) have been declining for cohorts born after 1980\n\nModel projections suggest CFR could drop to 0.78-0.89 for cohorts born in the 2000s\n\nClear postponement of childbearing detected in recent cohorts (positive timing shifts γ)\n\nBacktesting demonstrates excellent agreement with historical Census data (correlation = 0.9998)\n\nThe extended model (v4) provides superior fit to data (ΔWAIC ≈ 438 vs. base model)\n\nThe resampling approach successfully incorporates survey weights while maintaining model tractability","type":"content","url":"/tech-report#summary","position":3},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"1. Introduction"},"type":"lvl2","url":"/tech-report#id-1-introduction","position":4},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"1. Introduction"},"content":"Fertility rates in the United States have been declining for several decades. Period fertility rates (Total Fertility Rate, or TFR) provide a snapshot of births in a given year, but they can be influenced by timing effects—women delaying childbearing can depress TFR even if lifetime fertility remains unchanged.\n\nCohort fertility rates provide a more stable measure of long-term reproductive patterns by following specific birth cohorts throughout their reproductive years. The key question is: How many children will recent birth cohorts (those born in the 1990s and 2000s) have over their lifetimes?\n\nThis question has profound implications for:\n\nPopulation projections: Future population size and age structure\n\nEconomic planning: Labor force projections and dependency ratios\n\nPolicy design: Education, healthcare, childcare, and retirement systems\n\nSocial understanding: Changing family formation patterns and societal values\n\nProjecting cohort fertility presents several challenges:\n\nIncomplete data: Younger cohorts are still in their reproductive years\n\nSurvey weights: CPS uses complex sampling; results must reflect the population\n\nUncertainty quantification: Point estimates are insufficient; we need credible intervals\n\nModel validation: How can we trust projections for cohorts that haven’t completed fertility?\n\nWe address these challenges using a Bayesian hierarchical model that:\n\nModels age-specific birth rates (ASBR) across cohorts using log-linear structure\n\nUses Gaussian random walk priors to enforce smooth temporal changes\n\nIncorporates survey weights through resampling\n\nProvides full posterior distributions for all parameters and predictions\n\nValidates against historical data through backtesting","type":"content","url":"/tech-report#id-1-introduction","position":5},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"2. Data"},"type":"lvl2","url":"/tech-report#id-2-data","position":6},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"2. Data"},"content":"","type":"content","url":"/tech-report#id-2-data","position":7},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.1 Data Sources","lvl2":"2. Data"},"type":"lvl3","url":"/tech-report#id-2-1-data-sources","position":8},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.1 Data Sources","lvl2":"2. Data"},"content":"","type":"content","url":"/tech-report#id-2-1-data-sources","position":9},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Current Population Survey (CPS)","lvl3":"2.1 Data Sources","lvl2":"2. Data"},"type":"lvl4","url":"/tech-report#current-population-survey-cps","position":10},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Current Population Survey (CPS)","lvl3":"2.1 Data Sources","lvl2":"2. Data"},"content":"The CPS is a monthly household survey conducted by the US Census Bureau. In June of most years, it includes a Fertility Supplement asking women about their childbearing history.\n\nIPUMS CPS Data (Extract 13):\n\nYears: June 1976 through June 2024 (29 surveys)\n\nSample size: 3,913,169 total respondents; 1,168,265 female respondents aged 15-54\n\nKey variables:\n\nYEAR: Survey year\n\nAGE: Respondent’s age\n\nSEX: Sex (filtered to females, code 2)\n\nFREVER: Total number of children ever born (converted to parity)\n\nFRSUPPWT: Fertility supplement survey weight\n\nDerived: cohort = YEAR - AGE (birth year)\n\nNote on data quality: This analysis uses cumulative parity (children ever born) rather than annual birth events. Parity is generally reported more accurately than recent birth measures, especially at older ages, and is less subject to undercounting concerns that may affect annual birth statistics.\n\nSampling:\n\nThe CPS uses a stratified multi-stage sampling design\n\nSurvey weights (FRSUPPWT) are provided to make results representative of the US population\n\nThe fertility supplement weight is identical to the basic survey sample weight\n\nWeights account for sampling design, non-response, and post-stratification adjustments","type":"content","url":"/tech-report#current-population-survey-cps","position":11},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.2 Data Preprocessing","lvl2":"2. Data"},"type":"lvl3","url":"/tech-report#id-2-2-data-preprocessing","position":12},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.2 Data Preprocessing","lvl2":"2. Data"},"content":"The preprocessing pipeline involves several steps:\n\nLoad data: Read CPS data from IPUMS extract (.dta.gz format)\n\nVariable selection: Keep only relevant variables for modeling (female respondents, age ≤ 54)\n\nParity computation: Convert FREVER to parity (total children ever born)\n\nCohort construction: Compute birth year (cohort = year - age) and assign to 3-year bins (birth_group)\n\nAge binning: Group respondents into 3-year age bins (16, 19, 22, ..., 52) labeled by midpoint\n\nSurvey weight handling: Use resampling with replacement to incorporate FRSUPPWT weights\n\nAggregation: Compute total parity (sum_df) and number of respondents (count_df) for each cohort-age group\n\nValidation: Compare computed CFR with Census historical data\n\nSave: Store preprocessed data in HDF5 format for modeling\n\nSee notebooks/process_cps.ipynb for full preprocessing code.","type":"content","url":"/tech-report#id-2-2-data-preprocessing","position":13},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.3 Survey Weight Handling: Resampling Approach","lvl2":"2. Data"},"type":"lvl3","url":"/tech-report#id-2-3-survey-weight-handling-resampling-approach","position":14},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.3 Survey Weight Handling: Resampling Approach","lvl2":"2. Data"},"content":"Challenge: The Bayesian model uses a Poisson likelihood that expects integer counts. Survey-weighted data produces continuous (non-integer) values.\n\nSolution: Resampling with replacement according to survey weights:\n\nNormalize weights within each survey year\n\nResample respondents with probability proportional to their weight\n\nThis produces a pseudo-sample where each respondent can appear 0, 1, or multiple times\n\nThe resulting data represents the population rather than just the sample\n\nMaintains integer count structure for Poisson likelihood\n\nJustification:\n\nResampling using survey weights is a standard approximation for incorporating complex survey designs in Bayesian models\n\nPreserves the population distribution represented by weights\n\nMaintains computational tractability for Bayesian inference (integer counts for Poisson likelihood)\n\nAlternative approaches (weighted likelihood, continuous distributions) introduce additional complexity\n\nValidation against external Census data suggests the approach performs well for this application","type":"content","url":"/tech-report#id-2-3-survey-weight-handling-resampling-approach","position":15},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.4 Data Structure","lvl2":"2. Data"},"type":"lvl3","url":"/tech-report#id-2-4-data-structure","position":16},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"2.4 Data Structure","lvl2":"2. Data"},"content":"After preprocessing, the data is organized as:\n\nDimensions: 30 cohorts × 14 age groups\n\nObservations:\n\nsum_df: Total parity (sum of all children) for each cohort-age group\n\ncount_df: Number of respondents in each cohort-age group (after resampling)\n\nTotal children across all cells: 1,300,166\n\nNon-zero cells: 220 (out of 420 possible cells)\n\nLabels:\n\ncohort_labels: Birth cohort midpoints from 1922 to 2009 (30 cohorts in 3-year bins)\n\nage_labels: Age group midpoints from 15 to 54 (14 age groups in 3-year bins)\n\nExample structure:Cohort 1976 (birth years 1975-1977):\n  Age 16: 5 children total among 1,200 respondents\n  Age 19: 45 children total among 1,180 respondents\n  ...\n  Age 40: 2,100 children total among 1,050 respondents\n\nThe data forms a sparse matrix where older cohorts have observations at older ages, and younger cohorts only have observations at younger ages (since they haven’t reached older ages yet).\n\nThis heatmap shows the total parity (sum of children) for each birth cohort and age group combination. The diagonal structure reflects the survey design: we can only observe cohorts at ages they have reached by the survey years.","type":"content","url":"/tech-report#id-2-4-data-structure","position":17},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"3. Model"},"type":"lvl2","url":"/tech-report#id-3-model","position":18},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"3. Model"},"content":"","type":"content","url":"/tech-report#id-3-model","position":19},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.1 Model Structure","lvl2":"3. Model"},"type":"lvl3","url":"/tech-report#id-3-1-model-structure","position":20},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.1 Model Structure","lvl2":"3. Model"},"content":"The model uses a hierarchical log-linear structure to capture fertility patterns:\n\nAge-Specific Birth Rates (ASBR):λ[cohort, age] = exp(α[cohort] + β[age])\n\nWhere:\n\nα[cohort]: Cohort effect (log-scale baseline fertility for each cohort)\n\nβ[age]: Age effect (log-scale age-specific fertility pattern)\n\nλ[cohort, age]: Expected births per person in cohort at age\n\nCumulative Parity:\nThe cumulative number of children for each cohort at each age is the sum of ASBRs:μ[cohort, age] = Σ λ[cohort, age'] × n[cohort, age']\n                  age'≤age\n\nWhere n[cohort, age] is the number of respondents.\n\nLikelihood:\nObserved parity follows a Poisson distribution:observed_parity[cohort, age] ~ Poisson(μ[cohort, age])","type":"content","url":"/tech-report#id-3-1-model-structure","position":21},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.2 Prior Specifications","lvl2":"3. Model"},"type":"lvl3","url":"/tech-report#id-3-2-prior-specifications","position":22},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.2 Prior Specifications","lvl2":"3. Model"},"content":"Cohort effects (α): Gaussian random walkα[0] ~ Normal(0, 1)\nα[i] ~ Normal(α[i-1], σ_α) for i > 0\nσ_α ~ HalfNormal(0.1)\n\nThis prior enforces smooth changes across cohorts while allowing flexibility to capture trends.\n\nAge effects (β): Gaussian random walkβ[0] ~ Normal(0, 1)\nβ[j] ~ Normal(β[j-1], σ_β) for j > 0\nσ_β ~ HalfNormal(0.1)\n\nThis captures the characteristic age-fertility curve (low at young ages, peak in late 20s/early 30s, decline thereafter).","type":"content","url":"/tech-report#id-3-2-prior-specifications","position":23},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.3 Model Versions","lvl2":"3. Model"},"type":"lvl3","url":"/tech-report#id-3-3-model-versions","position":24},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.3 Model Versions","lvl2":"3. Model"},"content":"This report presents results from Version 4, which extends the base model with cohort-specific timing shift parameters:\n\nVersion 4 (primary - with timing shifts):\n\nBase model: log(λ_ij) = α_i + β_j\n\nExtended: log(λ_ij) = α_i + β_j + γ_i × age_centered_j\n\nγ_i: Timing shift parameter (positive = delayed childbearing)\n\nAll hyperparameters estimated: σ_α, σ_β, σ_γ\n\nAllows age-fertility curve to shift across cohorts\n\n77 total parameters (30 cohorts × (α + γ) + 14 ages × β + 3 hyperparameters)\n\nVersion 3 (comparison - base model):\n\nStandard log-linear model without timing shifts\n\nAll cohorts share the same age-fertility profile\n\n46 total parameters\n\nSee Appendix A for detailed version comparisons","type":"content","url":"/tech-report#id-3-3-model-versions","position":25},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.4 Inference","lvl2":"3. Model"},"type":"lvl3","url":"/tech-report#id-3-4-inference","position":26},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.4 Inference","lvl2":"3. Model"},"content":"MCMC Sampling:\n\nSampler: nutpie (high-performance Rust implementation of NUTS)\n\nChains: 4 independent chains\n\nSamples: 1,000 draws per chain (after 1,000 tuning samples)\n\nTotal: 4,000 posterior samples\n\nRandom seed: 17 (for reproducibility)\n\nConvergence diagnostics:\n\nR̂ (Gelman-Rubin statistic): All parameters have r̂ ≤ 1.00 (excellent convergence)\n\nEffective sample size (bulk): Min = 745 (excellent, well above 400 threshold)\n\nEffective sample size (tail): Min = 1,342 (excellent)\n\nTotal parameters: 77 (30 cohort effects + 30 timing shifts + 14 age effects + 3 hyperparameters)\n\nParameters with convergence issues: 0\n\nThe nutpie sampler produces excellent convergence with good effective sample sizes across all parameters, even with the extended model including timing shifts.","type":"content","url":"/tech-report#id-3-4-inference","position":27},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.5 Predictions","lvl2":"3. Model"},"type":"lvl3","url":"/tech-report#id-3-5-predictions","position":28},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"3.5 Predictions","lvl2":"3. Model"},"content":"Cohort Completed Fertility Rate (CFR):\nFor each cohort and each posterior sample:\n\nCompute λ[cohort, age] for all ages up to age 44 (end of reproductive years)\n\nSum across ages to get predicted CFR\n\nThis produces a posterior distribution over CFR for each cohort\n\nUncertainty quantification:\n\nPosterior mean: Best point estimate\n\n94% HDI (Highest Density Interval): Credible interval capturing uncertainty","type":"content","url":"/tech-report#id-3-5-predictions","position":29},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"4. Results"},"type":"lvl2","url":"/tech-report#id-4-results","position":30},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"4. Results"},"content":"","type":"content","url":"/tech-report#id-4-results","position":31},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.1 Model Parameters (Version 4)","lvl2":"4. Results"},"type":"lvl3","url":"/tech-report#id-4-1-model-parameters-version-4","position":32},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.1 Model Parameters (Version 4)","lvl2":"4. Results"},"content":"Hyperparameters (estimated from data):\n\nσ_α (cohort random walk): 0.149 (94% HDI: [0.086, 0.213])\n\nσ_β (age random walk): 0.781 (94% HDI: [0.558, 1.034])\n\nσ_γ (timing shift random walk): 0.013 (94% HDI: [0.008, 0.017])\n\nThe small value of σ_γ indicates timing shifts change smoothly across cohorts. The larger σ_α (compared to v3) reflects that some cohort variation is now captured by timing shifts rather than baseline fertility. The σ_β remains similar, indicating age effects are still the most variable component.","type":"content","url":"/tech-report#id-4-1-model-parameters-version-4","position":33},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.2 Timing Shifts Across Cohorts","lvl2":"4. Results"},"type":"lvl3","url":"/tech-report#id-4-2-timing-shifts-across-cohorts","position":34},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.2 Timing Shifts Across Cohorts","lvl2":"4. Results"},"content":"The timing shift parameter γ_i reveals systematic changes in the age at childbearing across cohorts:\n\nTiming shift (γ) summary:\n\nRange: -0.065 to +0.052 (additive in log-space)\n\nEarly cohorts (1920s-1940s): Negative γ (earlier childbearing)\n\nCohort 1934: γ = -0.065 (tilts curve toward younger ages)\n\nMiddle cohorts (1950s-1970s): Near-zero γ (stable timing)\n\nRecent cohorts (1980s-2000s): Positive γ (delayed childbearing)\n\nCohort 1997: γ = +0.052 (tilts curve toward older ages)\n\nConvergence: Excellent (max r̂ = 1.01, min ESS_bulk = 385)\n\nInterpretation: The additive formulation (γ_i × age_centered_j in log-space) creates a linear tilt in the log-fertility curve. Positive γ values shift fertility from younger to older ages (delayed childbearing), while negative values shift fertility toward younger ages (earlier childbearing).\n\nThis pattern is consistent with well-documented demographic trends: the postponement of childbearing in recent decades. Women born in the 1980s-2000s are systematically having children at older ages compared to earlier cohorts. The magnitude of the effect is substantial—a γ value of 0.05 combined with age_centered ≈ 10 adds 0.5 to the log-fertility rate at age 10 years above the mean, roughly increasing the rate by 65% relative to what it would be without the timing shift.","type":"content","url":"/tech-report#id-4-2-timing-shifts-across-cohorts","position":35},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.3 Cohort Effects","lvl2":"4. Results"},"type":"lvl3","url":"/tech-report#id-4-3-cohort-effects","position":36},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.3 Cohort Effects","lvl2":"4. Results"},"content":"\n\nCohort effects (α) summary:\n\nRange: -0.95 to +0.38 (log scale)\n\nPeak fertility cohort: 1964 (α = 0.38)\n\nLowest fertility cohort: 2006 (α = -0.95)\n\nTrend: Peak in 1960s, relatively stable through 1980s, then declining sharply\n\nConvergence: Excellent (max r̂ = 1.01, min ESS_bulk = 358)\n\nAfter accounting for timing shifts (γ), the cohort effects show that baseline fertility peaked for the 1960s cohorts, remained relatively stable through the 1980s, and has been declining steadily since then. The decline accelerates for cohorts born after 1990.\n\nNote: The peak cohort shifted from 1934 (in v3) to 1964 (in v4) because v4 explicitly models timing—the 1934 cohort had high total fertility but earlier childbearing (negative γ), while the 1964 cohort represents high baseline fertility with more typical timing.\n\nThe rate of decline for recent cohorts (1980-2000) remains comparable to the post-baby boom decline, both showing drops of approximately 1 child per woman over 20 years. The key difference is that the current decline starts from a much lower baseline.","type":"content","url":"/tech-report#id-4-3-cohort-effects","position":37},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.4 Age Effects","lvl2":"4. Results"},"type":"lvl3","url":"/tech-report#id-4-4-age-effects","position":38},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.4 Age Effects","lvl2":"4. Results"},"content":"\n\nAge effects (β) summary:\n\nRange: -7.05 to -1.13 (log scale)\n\nPeak fertility age: 24 (β = -1.13)\n\nLowest fertility age: 54 (β = -7.05)\n\nConvergence: Excellent (max r̂ = 1.01, min ESS_bulk = 421)\n\nThe age effects show the characteristic age-fertility curve with peak fertility in the mid-20s, representing the baseline age pattern before timing shifts are applied. Individual cohorts’ fertility curves can shift based on their γ values—positive γ tilts the curve toward older ages, while negative γ tilts it toward younger ages. The wide error bars at the oldest ages reflect limited data in those age groups.","type":"content","url":"/tech-report#id-4-4-age-effects","position":39},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.5 Model Validation","lvl2":"4. Results"},"type":"lvl3","url":"/tech-report#id-4-5-model-validation","position":40},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.5 Model Validation","lvl2":"4. Results"},"content":"The model’s retrodictions (predictions for cohort-age groups where we have data) fit the observed data well:\n\nThe dotted lines show model predictions, while points show observed mean parity. The model captures both the overall fertility levels and the age-specific patterns well across cohorts.\n\nComparison with Census data:\n\nThe model’s predictions align well with actual Census CFR data for completed cohorts, providing confidence in the projections for incomplete cohorts.","type":"content","url":"/tech-report#id-4-5-model-validation","position":41},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.6 Cohort Fertility Projections","lvl2":"4. Results"},"type":"lvl3","url":"/tech-report#id-4-6-cohort-fertility-projections","position":42},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"4.6 Cohort Fertility Projections","lvl2":"4. Results"},"content":"\n\nKey findings (CFR measured at age 42):\n\nPeak fertility: Cohort 1934 with CFR = 3.10 children per woman\n\nHistorical cohorts (born 1940s-1970s): CFR ≈ 2.0-2.5 children per woman\n\nTransition cohorts (born 1980-1990): CFR declining to 1.5-2.0\n\n1980 cohort: CFR = 1.86\n\nRecent cohorts (born 1990s-2000s): CFR dropping below 1.0\n\n2000 cohort: CFR = 0.89\n\n2009 cohort: CFR = 0.78\n\nLowest projected fertility: Cohort 2006 with CFR = 0.64\n\nConvergence diagnostics: All 77 parameters show excellent convergence with max r̂ = 1.01. Effective sample sizes are adequate (min ESS_bulk = 358, min ESS_tail = 653), though 21 parameters have ESS_bulk < 400 (still acceptable for inference).\n\nThe shaded region shows 94% credible intervals. The projections suggest a dramatic decline in completed fertility for cohorts born after 1980, with fertility rates dropping to levels comparable to current South Korea (CFR ≈ 0.8) for cohorts born in the 2000s.\n\nUncertainty and Model Assumptions:\n\nProjections for incomplete cohorts have wider credible intervals\n\nUncertainty increases for younger cohorts still in reproductive years\n\nImportant: The Gaussian random walk priors do not extrapolate trends. In the absence of data, they assume recent patterns persist (i.e., each cohort is similar to the previous one). This is conservative:\n\nThe model does NOT assume declining trends will continue indefinitely\n\nThe model does NOT assume trends will reverse\n\nProjections level off for the most recent cohorts where data is sparse\n\nExternal factors (policy changes, economic shocks, cultural shifts) could cause actual fertility to differ substantially from projections","type":"content","url":"/tech-report#id-4-6-cohort-fertility-projections","position":43},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"5. Discussion"},"type":"lvl2","url":"/tech-report#id-5-discussion","position":44},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"5. Discussion"},"content":"","type":"content","url":"/tech-report#id-5-discussion","position":45},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.1 Interpretation","lvl2":"5. Discussion"},"type":"lvl3","url":"/tech-report#id-5-1-interpretation","position":46},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.1 Interpretation","lvl2":"5. Discussion"},"content":"The model reveals two distinct dimensions of fertility decline:\n\nQuantum decline (captured by cohort effects α): Overall reduction in total lifetime births\n\nCohorts born after 1980 show sharply declining baseline fertility\n\nReflects decisions about whether and how many children to have\n\nTempo shifts (captured by timing parameters γ): Changes in the age at childbearing\n\nRecent cohorts (1980s-2000s) show positive γ (delayed childbearing)\n\nEarlier cohorts (1920s-1940s) show negative γ (earlier childbearing)\n\nMiddle cohorts (1950s-1970s) show near-zero γ (stable timing)\n\nThe postponement of childbearing (positive γ for recent cohorts) has important implications:\n\nWomen having their first child at older ages\n\nCompressed reproductive window may reduce total fertility (biological constraints)\n\nSome “tempo effect” may reflect delayed births that will eventually occur\n\nHowever, data for completed cohorts suggests delayed childbearing translates to reduced total fertility\n\nThe declining fertility trend reflects multiple factors:\n\nDelayed childbearing: Women having children at older ages (directly measured by γ)\n\nEconomic factors: Rising costs of childcare, education, housing\n\nEducational attainment: Higher education associated with lower fertility\n\nCareer priorities: Increased labor force participation\n\nAccess to contraception: Better family planning technologies\n\nSocial changes: Evolving attitudes toward family size","type":"content","url":"/tech-report#id-5-1-interpretation","position":47},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.2 Implications","lvl2":"5. Discussion"},"type":"lvl3","url":"/tech-report#id-5-2-implications","position":48},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.2 Implications","lvl2":"5. Discussion"},"content":"The projected decline is dramatic:\n\nCohorts born in the 2000s are projected to have CFR around 0.78-0.89 (well below replacement level of 2.1)\n\nThis represents a decline of over 70% from the peak (cohort 1934, CFR = 3.10)\n\nFor context, a CFR of 0.78 would be comparable to current South Korea, which has one of the world’s lowest fertility rates\n\nCFR measures the average number of children per woman across the entire cohort, including women with no children. CFRs below 1 are already observed in several high-income countries and are demographically feasible\n\nThe decline is driven by both reduced baseline fertility (α) and delayed childbearing (γ)\n\nIf current patterns persist:\n\nUS population growth will slow substantially or become negative\n\nWithout immigration, population could decline by 50% per generation\n\nDependency ratios will increase dramatically (fewer workers per retiree)\n\nImmigration affects period fertility rates more than completed cohort fertility; immigrant fertility in the US has also declined substantially, and second-generation fertility converges quickly toward native-born levels\n\nEconomic and social policies will need major adaptation:\n\nRetirement systems (Social Security, Medicare)\n\nHousing markets (demand shifts)\n\nLabor markets (workforce size)\n\nEducation systems (fewer students)\n\nTiming: The most dramatic declines are projected for cohorts born 1980-2000:\n\n1980 cohort: 1.86 (11% below replacement)\n\n2000 cohort: 0.89 (58% below replacement)\n\nChange represents a fertility decline of about 1 child per woman in just 20 years\n\nThis decline coincides with the postponement transition: cohorts born 1980-2000 show increasingly positive γ (delayed childbearing)\n\nHistorical context: This rate of decline is not unprecedented. It is comparable in magnitude and duration to the decline following the baby boom (cohorts born 1934-1954 saw CFR decline from 3.10 to approximately 2.0). However, the current decline starts from a much lower baseline, pushing fertility to historically unprecedented low levels.","type":"content","url":"/tech-report#id-5-2-implications","position":49},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.3 Model Strengths","lvl2":"5. Discussion"},"type":"lvl3","url":"/tech-report#id-5-3-model-strengths","position":50},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.3 Model Strengths","lvl2":"5. Discussion"},"content":"Comprehensive data: Nearly 50 years of CPS data (1976-2024)\n\nProper weight handling: Resampling approach maintains population representativeness\n\nUncertainty quantification: Full posterior distributions for all parameters\n\nValidation: Excellent agreement with Census historical data (correlation = 0.9998)\n\nInterpretability: Parameters have clear demographic meanings\n\nα captures overall fertility levels by cohort\n\nβ captures the age-fertility profile\n\nγ captures timing shifts (postponement/acceleration of childbearing)\n\nSeparates tempo from quantum: The extended model (v4) explicitly distinguishes between changes in timing (when) vs. total fertility (how many)\n\nConservative projections: Gaussian random walks do not extrapolate trends—they assume recent patterns persist in the absence of new data, avoiding overconfident predictions about distant futures","type":"content","url":"/tech-report#id-5-3-model-strengths","position":51},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.4 Limitations","lvl2":"5. Discussion"},"type":"lvl3","url":"/tech-report#id-5-4-limitations","position":52},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.4 Limitations","lvl2":"5. Discussion"},"content":"Severely limited data for youngest cohorts: The most recent cohorts have been observed over only a small fraction of their reproductive years:\n\nCohort\n\nObserved Ages\n\n% of Reproductive Span\n\nData Quality\n\n1988\n\n15-36\n\n73%\n\nGood\n\n1994\n\n15-30\n\n53%\n\nModerate\n\n2000\n\n15-24\n\n33%\n\nLimited\n\n2003\n\n15-21\n\n23%\n\nVery Limited\n\n2006\n\n15-18\n\n13%\n\nExtremely Limited\n\n2009\n\n15 only\n\n3%\n\nSingle age\n\nThe 2009 cohort has been observed at only age 15, providing essentially no useful information about lifetime fertility patterns. Cohorts born after 2000 have been observed primarily during ages 15-24, when fertility is relatively low. Projections for these cohorts rely almost entirely on:\n\nThe random walk priors assuming similarity to previous cohorts\n\nThe model structure (age effects, timing patterns)\n\nVery limited direct observations\n\nImplication: CFR projections for cohorts born after 2000 should be interpreted with extreme caution. These are model-based extrapolations, not data-driven estimates. Actual completed fertility for these cohorts will not be observable until the 2040s-2050s.\n\nParameter identifiability challenges for youngest cohorts: The limited data for recent cohorts creates a fundamental identifiability problem between quantum (total fertility, α) and tempo (timing, γ) effects. Analysis of posterior correlations between α and γ reveals a U-shaped pattern across cohorts:\n\nCohort Group\n\nCorrelation (α, γ)\n\nData Coverage\n\nIdentifiability\n\nOldest (1922-1940)\n\nr ≈ 0.985-0.995\n\nPost-reproductive only\n\nPoor\n\nMiddle (1945-1985)\n\nr ≈ 0.950-0.955\n\nFull reproductive span\n\nGood\n\nRecent (1988-2006)\n\nr ≈ 0.955-0.980\n\nEarly reproductive only\n\nPoor\n\nMinimum correlation occurs around cohort 1970 (r ≈ 0.950), which has the most complete reproductive data in our dataset.\n\nWhy the U-shape?\n\nOldest cohorts: Observed only after reproduction ended (ages 45-54+). The model sees final parity but not the age pattern during reproductive years, making it impossible to distinguish whether high/low fertility was achieved early or late.\n\nMiddle cohorts: Observed throughout reproductive years (ages 20-45). The model can observe the full age-fertility profile, allowing it to separately estimate baseline fertility (α) and timing shifts (γ).\n\nRecent cohorts: Observed only at young ages (15-27). For a given level of observed early fertility, the model admits a continuum of explanations:\n\nLow quantum + early timing: α = -0.8, γ = -0.02 → low baseline fertility, but having children earlier partially compensates\n\nHigh quantum + delayed timing: α = -0.6, γ = +0.02 → higher baseline fertility, but delay subtracts from young-age fertility\n\nMany combinations in between\n\nImplication: For the youngest cohorts, we cannot confidently distinguish whether projected low CFR represents primarily quantum decline (permanent reduction in lifetime fertility) versus tempo delay (postponement that may eventually recover). The posterior appropriately captures this uncertainty through high correlation between α and γ, but interpreting projections for cohorts born after 2000 requires acknowledging this fundamental ambiguity.\n\nModel assumptions:\n\nRandom walks assume each cohort is similar to the previous one in the absence of data\n\nThis is conservative but may not capture accelerating changes or reversals\n\nThe linear timing shift (γ × age_centered) is a simplification—actual timing changes may be more complex\n\nDoes not fully separate “tempo effect” (recoverable delays) from permanent reductions in completed fertility\n\nExternal shocks: Cannot predict sudden changes (e.g., pandemic effects, policy changes, economic crises)\n\nData limitations: CPS survey has limitations (coverage, response rates, recall bias)\n\nModel simplicity: The model is intentionally parsimonious and is validated on cohorts with completed fertility. More complex models improve in-sample fit but do not materially change the projections for completed cohort fertility. The model does not account for:\n\nSocioeconomic heterogeneity (education, income, race/ethnicity, region)\n\nNonlinear timing patterns (e.g., bimodal fertility schedules)\n\nPeriod effects that might affect all cohorts simultaneously","type":"content","url":"/tech-report#id-5-4-limitations","position":53},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.5 Future Directions","lvl2":"5. Discussion"},"type":"lvl3","url":"/tech-report#id-5-5-future-directions","position":54},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"5.5 Future Directions","lvl2":"5. Discussion"},"content":"Potential extensions:\n\nSubgroup analysis: Model fertility by education, race/ethnicity, region\n\nCovariate effects: Include economic indicators, policy variables\n\nAlternative models: Explore different prior specifications, likelihood functions\n\nInternational comparison: Apply to other countries’ data\n\nPolicy scenarios: Model impact of pro-natalist policies","type":"content","url":"/tech-report#id-5-5-future-directions","position":55},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"6. Conclusions"},"type":"lvl2","url":"/tech-report#id-6-conclusions","position":56},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"6. Conclusions"},"content":"This analysis uses Bayesian hierarchical modeling to project cohort fertility rates using 48 years of CPS data (1976-2024). Key findings:","type":"content","url":"/tech-report#id-6-conclusions","position":57},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.1 Main Results","lvl2":"6. Conclusions"},"type":"lvl3","url":"/tech-report#id-6-1-main-results","position":58},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.1 Main Results","lvl2":"6. Conclusions"},"content":"Dramatic fertility decline: Projected CFR drops from 3.10 (1934 cohort) to 0.78-0.89 (2000s cohorts), over 70% decline\n\nTwo-dimensional decline: The extended model (v4) reveals fertility decline has both quantum and tempo components:\n\nQuantum: Baseline fertility (α) declining sharply for cohorts born after 1980\n\nTempo: Systematic postponement of childbearing (positive γ) for recent cohorts\n\nTiming shifts: Clear postponement transition detected\n\nEarly cohorts (1930s): γ ≈ -0.065 (earlier childbearing)\n\nMiddle cohorts (1950s-1970s): γ ≈ 0 (stable timing)\n\nRecent cohorts (1980s-2000s): γ up to +0.052 (delayed childbearing)\n\nRecent acceleration: The steepest decline occurs for cohorts born 1980-2000, falling from 1.86 to 0.89 in just 20 years\n\nThis rate of decline (≈1 child per woman in 20 years) is comparable to the post-baby boom decline\n\nHowever, the current decline reaches historically unprecedented low levels\n\nCoincides with the postponement transition (increasingly positive γ)\n\nBelow replacement level: Cohorts born after 1995 are projected to have CFR well below the replacement level of 2.1\n\nModel validation: Excellent agreement with Census historical data (correlation = 0.9998) increases confidence in projections","type":"content","url":"/tech-report#id-6-1-main-results","position":59},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.2 Methodological Contributions","lvl2":"6. Conclusions"},"type":"lvl3","url":"/tech-report#id-6-2-methodological-contributions","position":60},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.2 Methodological Contributions","lvl2":"6. Conclusions"},"content":"Resampling approach: Successfully handles complex survey weights while maintaining integer counts for Poisson likelihood\n\nExtended log-linear model: Separates quantum from tempo by adding cohort-specific timing shift parameters (γ) in an additive log-space formulation\n\nRandom walk priors: Gaussian random walks with estimated hyperparameters capture smooth temporal changes:\n\nσ_α = 0.149 (cohort baseline fertility)\n\nσ_β = 0.781 (age effects)\n\nσ_γ = 0.013 (timing shifts)\n\nReveals age effects are most variable, timing shifts change smoothly\n\nUncertainty quantification: Full posterior distributions provide credible intervals for all projections, including uncertainty in hyperparameters\n\nComputational efficiency: nutpie sampler enables fast, reliable MCMC inference with excellent convergence even for 77-parameter model","type":"content","url":"/tech-report#id-6-2-methodological-contributions","position":61},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.3 Implications","lvl2":"6. Conclusions"},"type":"lvl3","url":"/tech-report#id-6-3-implications","position":62},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.3 Implications","lvl2":"6. Conclusions"},"content":"The projected fertility decline has profound implications:\n\nPopulation dynamics: Without immigration, US population could decline significantly\n\nEconomic planning: Labor force, retirement systems, housing markets all affected\n\nPolicy relevance: Understanding fertility trends is crucial for long-term planning","type":"content","url":"/tech-report#id-6-3-implications","position":63},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.4 Limitations and Caveats","lvl2":"6. Conclusions"},"type":"lvl3","url":"/tech-report#id-6-4-limitations-and-caveats","position":64},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"6.4 Limitations and Caveats","lvl2":"6. Conclusions"},"content":"Conservative projections: Gaussian random walks do not extrapolate declining trends—they level off for the youngest cohorts. Actual fertility could decline further or reverse depending on future conditions.\n\nNo heterogeneity: Does not account for differences by education, race/ethnicity, or region. Subgroup trends may differ substantially.\n\nIncomplete cohorts: Youngest cohorts have high uncertainty and limited data. Projections for cohorts born after 2000 are particularly uncertain.\n\nExternal factors: Cannot anticipate policy changes (e.g., parental leave, childcare subsidies), economic shocks, or cultural shifts that could substantially alter fertility behavior. Demographic trends exhibit inertia, and historically, large fertility reversals have been slow and rare even in the presence of policy interventions.\n\nTempo vs quantum distinction: The linear timing shift (γ × age_centered) captures changes in the age pattern but doesn’t fully separate recoverable “tempo effects” (delayed births that will eventually occur) from permanent quantum decline (births that will never occur). However, the extended model (v4) that explicitly accounts for cohort-specific timing shifts fits the data better but produces similar completed fertility projections, suggesting that delayed childbearing alone is insufficient to explain the observed declines in cohort fertility.\n\nModel simplicity: Linear timing shift is a simplification—actual timing changes may be more complex (e.g., bimodal fertility schedules).\n\nWhile substantial uncertainty remains for incomplete cohorts, the model provides a principled, data-driven framework for understanding long-term fertility trends and their potential implications for US demographics. The projections should be interpreted as “what we would expect if recent patterns persist,” not as forecasts of what will definitely occur.","type":"content","url":"/tech-report#id-6-4-limitations-and-caveats","position":65},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"References"},"type":"lvl2","url":"/tech-report#references","position":66},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"References"},"content":"[To be added]\n\nIPUMS CPS: \n\nhttps://​cps​.ipums​.org/\n\nUS Census Bureau Fertility Data\n\nRelevant demographic literature on cohort fertility","type":"content","url":"/tech-report#references","position":67},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl2","url":"/tech-report#appendix-a-model-versions-and-selection","position":68},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"Appendix A: Model Versions and Selection"},"content":"","type":"content","url":"/tech-report#appendix-a-model-versions-and-selection","position":69},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.1 Overview of Model Versions","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-1-overview-of-model-versions","position":70},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.1 Overview of Model Versions","lvl2":"Appendix A: Model Versions and Selection"},"content":"This project developed multiple model versions with increasing complexity:\n\nVersion 3: Base model with estimated hyperparameters (σ_α and σ_β)\n\nVersion 4: Extended model with cohort-specific timing shifts (γ)\n\nThe main report presents results from Version 4, which provides the most complete picture of fertility dynamics by separating quantum (total fertility) from tempo (timing) effects. This appendix compares v3 and v4 to document the rationale for model selection.\n\nNote: An earlier Version 2 with fixed σ_α was also developed but is not discussed here; it produced nearly identical results to v3 (see sections A.2-A.4 for details).","type":"content","url":"/tech-report#a-1-overview-of-model-versions","position":71},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.2 Differences Between Versions 2.0 and 3.0","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-2-differences-between-versions-2-0-and-3-0","position":72},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.2 Differences Between Versions 2.0 and 3.0","lvl2":"Appendix A: Model Versions and Selection"},"content":"Both model versions use the same basic structure (log-linear model with Gaussian random walk priors for cohort and age effects), but differ in how the random walk hyperparameters are handled.","type":"content","url":"/tech-report#a-2-differences-between-versions-2-0-and-3-0","position":73},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Version 2.0","lvl3":"A.2 Differences Between Versions 2.0 and 3.0","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl4","url":"/tech-report#version-2-0","position":74},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Version 2.0","lvl3":"A.2 Differences Between Versions 2.0 and 3.0","lvl2":"Appendix A: Model Versions and Selection"},"content":"Hyperparameter specification:\n\nσ_α = 0.05 (fixed)\n\nσ_β ~ HalfNormal(0.1) (estimated)\n\nRationale: Initially set σ_α to a small fixed value based on exploratory analysis, while allowing σ_β to be estimated.","type":"content","url":"/tech-report#version-2-0","position":75},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Version 3","lvl3":"A.2 Differences Between Versions 2.0 and 3.0","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl4","url":"/tech-report#version-3","position":76},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Version 3","lvl3":"A.2 Differences Between Versions 2.0 and 3.0","lvl2":"Appendix A: Model Versions and Selection"},"content":"Hyperparameter specification:\n\nσ_α ~ HalfNormal(0.1) (estimated)\n\nσ_β ~ HalfNormal(0.3) (estimated)\n\nRationale: Let the data determine both smoothing parameters, following standard Bayesian practice.","type":"content","url":"/tech-report#version-3","position":77},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.2 Comparison of Results","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-2-comparison-of-results","position":78},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.2 Comparison of Results","lvl2":"Appendix A: Model Versions and Selection"},"content":"The two versions produce nearly identical predictions:\n\nMetric\n\nv2\n\nv3\n\nDifference\n\nHyperparameters\n\n\n\n\n\n\n\nσ_α\n\n0.050 (fixed)\n\n0.094 ± 0.015\n\nData suggests higher\n\nσ_β\n\n0.487 ± 0.048\n\n0.786 ± 0.128\n\nData suggests higher\n\nCFR Projections\n\n\n\n\n\n\n\nPeak CFR (1934)\n\n3.096\n\n3.099\n\n+0.003\n\n1980 cohort\n\n1.845\n\n1.845\n\n0.000\n\n2000 cohort\n\n0.874\n\n0.874\n\n0.000\n\nLowest CFR (2003)\n\n0.700\n\n0.697\n\n-0.003\n\nConvergence\n\n\n\n\n\n\n\nMax r̂\n\n1.01\n\n1.01\n\nExcellent both\n\nMin ESS_bulk\n\n~400\n\n800\n\nGood both\n\nKey observation: Despite different hyperparameter values, CFR predictions differ by at most 0.003 children per woman (< 0.5%), demonstrating robustness.","type":"content","url":"/tech-report#a-2-comparison-of-results","position":79},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.3 Decision Rationale: Why Version 3?","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-3-decision-rationale-why-version-3","position":80},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.3 Decision Rationale: Why Version 3?","lvl2":"Appendix A: Model Versions and Selection"},"content":"We selected Version 3 as the primary model for the following reasons:\n\n1. Statistical Principles\n\nEstimating hyperparameters is the standard Bayesian approach\n\nProperly quantifies uncertainty in all model parameters\n\nAvoids arbitrary choices about smoothing parameters\n\n2. Data-Driven Insights\n\nThe data suggests σ_α ≈ 0.094 (not 0.05)\n\nThe data suggests σ_β ≈ 0.786 (much larger than initially assumed)\n\nThis reveals that age effects are more variable than cohort effects, which is demographically informative\n\n3. Robustness\n\nPredictions are nearly identical to v2\n\nResults are robust to modeling choices\n\nThis agreement strengthens confidence in the findings\n\n4. Computational Feasibility\n\nExcellent convergence with nutpie sampler (r̂ ≤ 1.01 for all parameters)\n\nAdequate effective sample sizes (min ESS_bulk = 800)\n\nMinimal increase in computation time\n\n5. Publishability\n\nMore defensible for technical/academic audiences\n\nStandard practice in hierarchical Bayesian modeling\n\nAddresses potential reviewer concerns about fixed hyperparameters","type":"content","url":"/tech-report#a-3-decision-rationale-why-version-3","position":81},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.4 Sensitivity Analysis (v2 vs v3)","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-4-sensitivity-analysis-v2-vs-v3","position":82},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.4 Sensitivity Analysis (v2 vs v3)","lvl2":"Appendix A: Model Versions and Selection"},"content":"The minimal differences between versions demonstrates that results are robust to:\n\nChoice of hyperparameter priors\n\nWhether hyperparameters are fixed or estimated\n\nSpecific hyperparameter values\n\nThis robustness is important for interpretation: the projected fertility decline is not an artifact of modeling choices but a strong signal in the data.","type":"content","url":"/tech-report#a-4-sensitivity-analysis-v2-vs-v3","position":83},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.5 Version 4: Extended Model with Timing Shifts","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-5-version-4-extended-model-with-timing-shifts","position":84},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.5 Version 4: Extended Model with Timing Shifts","lvl2":"Appendix A: Model Versions and Selection"},"content":"Version 4 extends the base model to explicitly capture cohort-specific changes in the timing of childbearing.","type":"content","url":"/tech-report#a-5-version-4-extended-model-with-timing-shifts","position":85},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Model Structure","lvl3":"A.5 Version 4: Extended Model with Timing Shifts","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl4","url":"/tech-report#model-structure","position":86},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Model Structure","lvl3":"A.5 Version 4: Extended Model with Timing Shifts","lvl2":"Appendix A: Model Versions and Selection"},"content":"Base model (v3):\\log(\\lambda_{ij}) = \\alpha_i + \\beta_j\n\nExtended model (v4):\\log(\\lambda_{ij}) = \\alpha_i + \\beta_j + \\gamma_i \\times \\text{age\\_centered}_j\n\nWhere:\n\nα_i: Cohort effect (baseline fertility level)\n\nβ_j: Age effect (baseline age-fertility profile)\n\nγ_i: Timing shift parameter (positive = delayed childbearing)\n\nage_centered_j: Age relative to mean (perfectly centered, zero sum)\n\nPrior specification:\n\nγ follows a Gaussian random walk: γ_i ~ Normal(γ_{i-1}, σ_γ)\n\nσ_γ ~ HalfNormal(0.1), estimated from data\n\nZero-mean constraint: Σγ_i = 0","type":"content","url":"/tech-report#model-structure","position":87},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Interpretation","lvl3":"A.5 Version 4: Extended Model with Timing Shifts","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl4","url":"/tech-report#interpretation","position":88},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl4":"Interpretation","lvl3":"A.5 Version 4: Extended Model with Timing Shifts","lvl2":"Appendix A: Model Versions and Selection"},"content":"The γ parameter creates a linear tilt in the log-fertility curve:\n\nPositive γ: Fertility shifts from younger to older ages (delayed childbearing)\n\nNegative γ: Fertility shifts from older to younger ages (earlier childbearing)\n\nZero γ: No timing shift, reverts to base model\n\nThe additive formulation (in log-space) ensures:\n\nAll rates remain positive after exponentiation\n\nStandard log-linear model interpretation\n\nNo need for explicit positivity constraints","type":"content","url":"/tech-report#interpretation","position":89},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.6 Comparison: Version 3 vs 4","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-6-comparison-version-3-vs-4","position":90},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.6 Comparison: Version 3 vs 4","lvl2":"Appendix A: Model Versions and Selection"},"content":"|| Metric | v3 | v4 | Difference/Notes |\n||--------|------|------|------------------|\n|| Model Complexity |\n|| Parameters | 46 | 77 | +31 (adds 30 γ + 1 σ_γ) |\n|| Hyperparameters |\n|| σ_α | 0.094 ± 0.015 | 0.149 ± 0.034 | Increased (timing absorbs some variation) |\n|| σ_β | 0.786 ± 0.128 | 0.782 ± 0.128 | Nearly identical |\n|| σ_γ | N/A | 0.012 ± 0.002 | New parameter (small, smooth) |\n|| Timing Shifts |\n|| γ range | N/A | -0.065 to +0.052 | Clear postponement pattern |\n|| Early cohorts (1930s) | N/A | γ ≈ -0.065 | Earlier childbearing |\n|| Recent cohorts (1990s) | N/A | γ ≈ +0.052 | Delayed childbearing |\n|| CFR Projections |\n|| Peak CFR (1934) | 3.099 | 3.105 | +0.006 |\n|| 1980 cohort | 1.845 | 1.861 | +0.016 |\n|| 2000 cohort | 0.874 | 0.894 | +0.020 |\n|| 2009 cohort | 0.871 | 0.786 | -0.085 (notable) |\n|| Lowest CFR | 0.697 (2003) | 0.644 (2006) | Lower minimum |\n|| Convergence |\n|| Max r̂ | 1.01 | 1.00 | Excellent both |\n|| Min ESS_bulk | 800 | 745 | Excellent both (>400 threshold) |\n|| Params with ESS<400 | 0 | 0 | All parameters well-sampled |\n|| Goodness of Fit |\n|| MAE | 172.8 | 127.0 | v4 lower error |\n|| RMSE | 232.9 | 167.4 | v4 lower error |\n|| MAPE | 12.23% | 11.12% | v4 better prediction |\n|| WAIC (ELPD) | -2844.4 | -2406.4 | v4 better fit (higher ELPD) |\n|| LOO (ELPD) | -2845.6 | -2415.7 | v4 better fit |\n\nKey observations:\n\nTiming shifts detected: Clear systematic pattern in γ (postponement in recent cohorts)\n\nImproved model fit: v4 shows better goodness of fit metrics across the board:\n\nMAPE decreases from 12.23% to 11.12%\n\nWAIC and LOO strongly favor v4 (ΔELPD ≈ 430)\n\nModest CFR changes: Most differences < 0.02, except youngest cohorts\n\nHigher complexity: 31 additional parameters, but convergence remains excellent:\n\nAll 77 parameters have ESS_bulk > 400\n\nExcellent convergence (max r̂ = 1.00)\n\nCohort interpretation: Timing separated from quantity reveals distinct patterns","type":"content","url":"/tech-report#a-6-comparison-version-3-vs-4","position":91},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.7 Decision Rationale: Why Version 4?","lvl2":"Appendix A: Model Versions and Selection"},"type":"lvl3","url":"/tech-report#a-7-decision-rationale-why-version-4","position":92},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl3":"A.7 Decision Rationale: Why Version 4?","lvl2":"Appendix A: Model Versions and Selection"},"content":"We selected Version 4 as the primary model for the following reasons:\n\n1. Demographic Insight\n\nExplicitly separates quantum (how many) from tempo (when)\n\nCaptures well-documented postponement of childbearing\n\nγ parameters have clear demographic interpretation\n\nReveals that recent cohorts show both lower fertility and delayed timing\n\n2. Substantive Findings\n\nTiming shifts are statistically significant (γ ranges from -0.065 to +0.052)\n\nSystematic pattern: negative for early cohorts → near-zero for middle cohorts → positive for recent cohorts\n\nConsistent with demographic theory and empirical literature on fertility postponement\n\nThe 1934 cohort’s high CFR partly reflects earlier childbearing (negative γ)\n\n3. Model Fit\n\nExcellent convergence (max r̂ = 1.00, all parameters)\n\nExcellent ESS for all parameters (min = 745, all > 400 threshold)\n\nSuperior goodness of fit: MAPE = 11.12%, ΔWAIC ≈ 438 favoring v4\n\nMore flexible model better captures cohort-specific age patterns\n\n4. Theoretical Motivation\n\nAge-fertility patterns are known to shift across cohorts (Bongaarts-Feeney tempo effect)\n\nNot modeling timing shifts conflates two distinct demographic processes\n\nMay help distinguish recoverable tempo effects from quantum decline\n\n5. Robustness\n\nCFR projections largely similar to v3 (most differences < 2%)\n\nCore findings (dramatic decline for recent cohorts) unchanged\n\nAdds new dimension without overturning previous results\n\nTradeoffs:\n\nComplexity: 77 vs 46 parameters (67% increase)\n\nComputation: Requires more MCMC draws to achieve adequate ESS (though still fast with nutpie)\n\nInterpretability: More parameters to explain, but each has clear meaning\n\nLimitations of v4:\n\nLinear timing shift (γ × age_centered) is a simplification\n\nDoesn’t fully separate recoverable “tempo effect” from permanent quantum decline\n\nRequires more data to estimate additional parameters reliably\n\nConclusion: Version 4 is the recommended primary model. It provides richer demographic insights by explicitly modeling the postponement of childbearing, achieves superior model fit (ΔWAIC ≈ 438), maintains excellent convergence with excellent ESS across all 77 parameters, and produces projections that are substantively similar to v3 for most cohorts while revealing important timing patterns that are obscured in the base model. The timing shifts (γ) are not only statistically significant but also demographically meaningful, capturing the well-documented postponement transition in recent cohorts.","type":"content","url":"/tech-report#a-7-decision-rationale-why-version-4","position":93},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"Appendix B: Code and Reproducibility"},"type":"lvl2","url":"/tech-report#appendix-b-code-and-reproducibility","position":94},{"hierarchy":{"lvl1":"Technical Report: Bayesian Fertility Rate Projections","lvl2":"Appendix B: Code and Reproducibility"},"content":"All code for this project is available at: \n\nhttps://​github​.com​/AllenDowney​/BayesFertility\n\nKey notebooks:\n\nnotebooks/process_cps.ipynb: Data preprocessing pipeline\n\nnotebooks/fertility_cps3.ipynb: Model fitting and analysis (v3, comparison)\n\nnotebooks/fertility_cps4.ipynb: Model fitting and analysis (v4, primary)\n\nRequirements:\n\nPython 3.8+\n\nPyMC 5.0+\n\nnutpie (for fast MCMC sampling)\n\nArviZ, NumPy, Pandas, Matplotlib\n\nSee requirements.txt for full dependencies.\n\nReproducibility:\n\nAll random seeds are set (17 for data resampling and MCMC)\n\nPreprocessed data saved in HDF5 format\n\nModel results saved for regression testing\n\nLogs document all parameter values and diagnostics","type":"content","url":"/tech-report#appendix-b-code-and-reproducibility","position":95}]}